backend/load/artillery-stress.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://127.0.0.1:4000' }}"
  phases:
    - duration: 30
      arrivalRate: 20
      rampTo: 60
      name: ramp-up
    - duration: 60
      arrivalRate: 60
      name: sustained-stress
  defaults:
    headers:
      x-user-id: load-user
scenarios:
  - name: mixed-read-traffic
    flow:
      - get:
          url: "/health"
      - get:
          url: "/metrics"